import re


#1.去除多余空格
# 示例文本
text = "AI is coming"
# 替换多个空格为一个空格
text = re.sub(r"\s+", " ", text)
print(text)
# 输出: "AI is coming"


#2.去除多余换行
text = "人工智能\n\n是未来的发展方向\n\n\n机器学习是其重要分支"
# 连续换行替换成一个换行
text = re.sub(r"\n+", "\n", text)
print(text)
# 输出:
# 人工智能
# 是未来的发展方向
# 机器学习是其重要分支


#3.去除特殊字符
# 示例文本
text = "@@@@@\n*****\n人工智能是未来的方向\n#####"
# 删除常见特殊字符
text = re.sub(r"[@#*■□]+", "", text)
print(text)
# 输出:
# 人工智能是未来的方向


# 如何快速找到文章里面出现哪些特殊字符
# 1.先获取加载出来的文本
# 2.把字符分割成单个字,split('')或者list()
# 3.使用集合去重,去掉  [\u4e00-\u9fa5a-zA-Z0-9]
# 4.看看有哪些剩余的字符,去掉常见的字符,比如(,.!?:'*#等)
# 5.把剩下的全部堆到 r'[]' 中,对原文进行全部去除